# Условные операторы if, elif, else (if - если), (elif - иначе если), (else - иначе или ещё)
# Часть 1
# Потоки!

# a = float(input('Введите число: '))
# if a == 5:
#     print('Поздравляем всё верно!', 'Число:', f'{a} -', 'тип данных:', type(a))
#
# else:
#     print('Программа выполнена не правильно, повторите!')

# x = 5 # Основной блок выполнения кода
#
# if  x == 0:
#     print('if')
# elif x > 0:
#     print('elif')
# else:
#     print('else')
#
# print(4 != 3)

x = 6 # Основной блок выполнения кода

if x == 0:
    x +=1
elif x > 5:
    x +=1

print(5/x)
print('Программа завершена!')